app/controllers/pins_controller.rb

SELECT "pins".* FROM "pins" ORDER BY created_at DESC
---
  def index
    @pins = Pin.all

INSERT INTO "pins" ("created_at", "description", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", Sat, 18 Jan 2014 06:15:23 UTC +00:00], ["description", "Let's see what happens."], ["updated_at", Sat, 18 Jan 2014 06:15:23 UTC +00:00], ["user_id", 1]]
---
  def create
    @pin = current_user.pins.build(pin_params)

    respond_to do |format|
      if @pin.save

UPDATE "pins" SET "description" = ?, "updated_at" = ? WHERE "pins"."id" = 8  [["description", "Created by user test!"], ["updated_at", Sat, 18 Jan 2014 07:58:02 UTC +00:00]]
---
  def update
    respond_to do |format|
      if @pin.update(pin_params)