app/controllers/pins_controller.rb

  def index
    @pins = Pin.all.order('created_at DESC').paginate(:page => params[:page], :per_page => 8)
---
SELECT "pins".* FROM "pins" ORDER BY created_at DESC LIMIT 3 OFFSET 0
SELECT COUNT(*) FROM "pins"